In [4]:
import pandas as pd
from sqlalchemy import create_engine

In [5]:
# Connect to sqlite db
db_file = r'datasets/salesdata.db'
engine = create_engine(r"sqlite:///{}".format(db_file))
sql = "select name from sqlite_master where type = 'table';"
pd.read_sql(sql, engine)

     name
0  scores

In [6]:
sql = 'SELECT * from scores'
sales_data_df = pd.read_sql(sql, engine)
sales_data_df.head()

   index  Sales Person  Intelligence  Extroversion  $ Sales/Week
0      0             1            89            21          2625
1      1             2            93            24          2700
2      2             3            91            21          3100
3      3             4           122            23          3150
4      4             5           115            27          3175